Revit 2027 API
FailureMessage.GetAdditionalElements Method
 Retrieves list of the additional reference elements for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAdditionalElements()
Public Function GetAdditionalElements As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAdditionalElements()
member GetAdditionalElements : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The additional elements.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace